package io.wispforest.owo.util;

public final class KawaiiUtil {

    private KawaiiUtil() {}

    private static final String[] kaomoji = """
            (* ^ ω ^)
            (´ ∀ ` *)
            ٩(◕‿◕｡)۶
            ☆*:.｡.o(≧▽≦)o.｡.:*☆
            (o^▽^o)
            (⌒▽⌒)☆
            <(￣︶￣)>
            。.:☆*:･'(*⌒―⌒*)))
            ヽ(・∀・)ﾉ
            (´｡• ω •｡`)
            (￣ω￣)
            ｀;:゛;｀;･(°ε° )
            (o･ω･o)
            (＠＾◡＾)
            ヽ(*・ω・)ﾉ
            (o_ _)ﾉ彡☆
            (^人^)
            (o´▽`o)
            (*´▽`*)
            ｡ﾟ( ﾟ^∀^ﾟ)ﾟ｡
            ( ´ ω ` )
            (((o(*°▽°*)o)))
            (≧◡≦)
            (o´∀`o)
            (´• ω •`)
            (＾▽＾)
            (⌒ω⌒)
            ∑d(°∀°d)
            ╰(▔∀▔)╯
            (─‿‿─)
            (*^‿^*)
            ヽ(o^ ^o)ﾉ
            (✯◡✯)
            (◕‿◕)
            (*≧ω≦*)
            (☆▽☆)
            (⌒‿⌒)
            ＼(≧▽≦)／
            ヽ(o＾▽＾o)ノ
            ☆ ～('▽^人)
            (*°▽°*)
            ٩(｡•́‿•̀｡)۶
            (✧ω✧)
            ヽ(*⌒▽⌒*)ﾉ
            (´｡• ᵕ •｡`)
            ( ´ ▽ ` )
            (￣▽￣)
            ╰(*´︶`*)╯
            ヽ(>∀<☆)ノ
            o(≧▽≦)o
            (☆ω☆)
            (っ˘ω˘ς )
            ＼(￣▽￣)／
            (*¯︶¯*)
            ＼(＾▽＾)／
            ٩(◕‿◕)۶
            (o˘◡˘o)
            \\(★ω★)/
            \\(^ヮ^)/
            (〃＾▽＾〃)
            (╯✧▽✧)╯
            o(>ω<)o
            o( ❛ᴗ❛ )o
            ｡ﾟ(TヮT)ﾟ｡
            ( ‾́ ◡ ‾́ )
            (ﾉ´ヮ`)ﾉ*: ･ﾟ
            (b ᵔ▽ᵔ)b
            (๑˃ᴗ˂)ﻭ
            (๑˘︶˘๑)
            ( ˙꒳˙ )
            (*꒦ິ꒳꒦ີ)
            °˖✧◝(⁰▿⁰)◜✧˖°
            (´･ᴗ･ ` )
            (ﾉ◕ヮ◕)ﾉ*:･ﾟ✧
            („• ֊ •„)
            (.❛ ᴗ ❛.)
            (⁀ᗢ⁀)
            (￢‿￢ )
            (¬‿¬ )
            (*￣▽￣)b
            ( ˙▿˙ )
            (¯▿¯)
            ( ◕▿◕ )
            ＼(٥⁀▽⁀ )／
            („• ᴗ •„)
            (ᵔ◡ᵔ)
            ( ´ ▿ ` )
            (づ￣ ³￣)づ
            (つ≧▽≦)つ
            (つ✧ω✧)つ
            (づ ◕‿◕ )づ
            (⊃｡•́‿•̀｡)⊃
            (つ . •́ _ʖ •̀ .)つ
            (っಠ‿ಠ)っ
            (づ◡﹏◡)づ
            ⊂(´• ω •`⊂)
            ⊂(･ω･*⊂)
            ⊂(￣▽￣)⊃
            ⊂( ´ ▽ ` )⊃
            ( ~*-*)~
            (^_~)
            ( ﾟｏ⌒)
            (^_-)≡☆
            (^ω~)
            (>ω^)
            (~人^)
            (^_-)
            ( -_・)
            (^_<)〜☆
            (^人<)〜☆
            ☆⌒(≧▽° )
            ☆⌒(ゝ。∂)
            (^_<)
            (^_−)☆
            (･ω<)☆
            (^.~)☆
            (^.~)
            (ﾉ´ з `)ノ
            (♡μ_μ)
            (*^^*)♡
            ☆⌒ヽ(*'､^*)chu
            (♡-_-♡)
            (￣ε￣＠)
            ヽ(♡‿♡)ノ
            ( ´ ∀ `)ノ～ ♡
            (─‿‿─)♡
            (´｡• ᵕ •｡`) ♡
            (*♡∀♡)
            (｡・//ε//・｡)
            (´ ω `♡)
            ♡( ◡‿◡ )
            (◕‿◕)♡
            (/▽＼*)｡o○♡
            (ღ˘⌣˘ღ)
            (♡°▽°♡)
            ♡(｡- ω -)
            ♡ ～('▽^人)
            (´• ω •`) ♡
            (´ ε ` )♡
            (´｡• ω •｡`) ♡
            ( ´ ▽ ` ).｡ｏ♡
            ╰(*´︶`*)╯♡
            (*˘︶˘*).｡.:*♡
            (♡˙︶˙♡)
            ♡＼(￣▽￣)／♡
            (≧◡≦) ♡
            (⌒▽⌒)♡
            (*¯ ³¯*)♡
            (っ˘з(˘⌣˘ ) ♡
            ♡ (˘▽˘>ԅ( ˘⌣˘)
            ( ˘⌣˘)♡(˘⌣˘ )
            (/^-^(^ ^*)/ ♡
            ٩(♡ε♡)۶
            σ(≧ε≦σ) ♡
            ♡ (⇀ 3 ↼)
            ♡ (￣З￣)
            (´♡‿♡`)
            (°◡°♡)
            Σ>―(〃°ω°〃)♡→
            (´,,•ω•,,)♡
            (´꒳`)♡
            """.split("\n");

    /**
     * Prepends a randomly chosen Kaomoji to the given String
     *
     * @param string The string the process
     * @return {@code string} with a random Kaomoji prepended
     */
    public static String uwuify(String string) {
        return string + " " + uwuGen();
    }

    /**
     * @return A random Kaomoji
     */
    public static String uwuGen() {
        return kaomoji[(int) (Math.random() * (kaomoji.length - 1))];
    }

}
